In [1]:
import pandas as pd

# Load data

In [2]:
df = pd.read_excel('../Data/00_Brazil_Troughput_2010-2024_RAW.xlsx')
df.head()

,Ano,Mês,Total de Movimentação Contêineres (Bruto)\n(TEU) Twenty Feet Equivalent Unit
0,2024,jan,1050112.50
1,2024,fev,1022448.75
2,2024,mar,1134192.25
3,2024,abr,1147312.75
4,2024,mai,1104543.25

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 3 columns):
 #   Column                                                                       Non-Null Count  Dtype
---  ------                                                                       --------------  -----
 0   Ano                                                                          180 non-null    int64
 1   Mês                                                                          180 non-null    object
 2   Total de Movimentação Contêineres (Bruto)
(TEU) Twenty Feet Equivalent Unit  180 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 4.3+ KB

# Change columns names fro PT to EN

In [4]:
df.rename(columns={ "Ano": "Year",
                    "Mês": "Month",
                    "Total de Movimentação Contêineres (Bruto)\n(TEU) Twenty Feet Equivalent Unit": "TEU"}, inplace=True)

In [6]:
dict_month = {
                'jan': 'jan',
                'fev': 'feb',
                'mar': 'mar',
                'abr': 'apr',
                'mai': 'may',
                'jun': 'jun',
                'jul': 'jul',
                'ago': 'aug',
                'set': 'sep',
                'out': 'oct',
                'nov': 'nov',
                'dez': 'dec'
}

df['Month'] = df['Month'].map(dict_month)

# Check overall data

In [7]:
df.head()

   Year Month         TEU
0  2024   jan  1050112.50
1  2024   feb  1022448.75
2  2024   mar  1134192.25
3  2024   apr  1147312.75
4  2024   may  1104543.25

In [8]:
df.describe( )

              Year           TEU
count   180.000000  1.800000e+02
mean   2017.000000  8.269567e+05
std       4.332545  1.574484e+05
min    2010.000000  4.478690e+05
25%    2013.000000  7.214153e+05
50%    2017.000000  8.057364e+05
75%    2021.000000  9.308001e+05
max    2024.000000  1.254651e+06

In [9]:
df.describe(include='object')

       Month
count    180
unique    12
top      jan
freq      15

# Create Date Column

In [10]:
df['Date'] = df['Year'].astype(str) + '-' + df['Month'].astype(str)

df['Date'] = pd.to_datetime(df['Date'], format='%Y-%b')

df.head()

   Year Month         TEU       Date
0  2024   jan  1050112.50 2024-01-01
1  2024   feb  1022448.75 2024-02-01
2  2024   mar  1134192.25 2024-03-01
3  2024   apr  1147312.75 2024-04-01
4  2024   may  1104543.25 2024-05-01

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    180 non-null    int64
 1   Month   180 non-null    object
 2   TEU     180 non-null    float64
 3   Date    180 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 5.8+ KB

In [13]:
df = df.sort_values(by='Date', ascending=True)
df.head()

     Year Month       TEU       Date
168  2010   jan  493136.0 2010-01-01
169  2010   feb  447869.0 2010-02-01
170  2010   mar  532599.0 2010-03-01
171  2010   apr  485357.0 2010-04-01
172  2010   may  596628.0 2010-05-01

In [16]:
df = df[['Date', 'TEU']].reset_index(drop=True)

In [17]:
df.head()

        Date       TEU
0 2010-01-01  493136.0
1 2010-02-01  447869.0
2 2010-03-01  532599.0
3 2010-04-01  485357.0
4 2010-05-01  596628.0

# Export dataset

In [18]:
df.to_csv('../Data/01_Brazil_Troughtput_clean.csv', index=False)